app/Http/Requests/ProductUpdateRequest.php

select * from `products` where (`slug` = 'quos-nostrum-autem-quos') limit 1
---
    public function rules()
    {
        $product = Product::where(['slug'=> $this->product])->firstOrFail();