app/Helpers/Helpers.php

function languages()
{
    return Language::all();
---
select * from `languages`