app/Http/Controllers/CategoryController.php

select * from `products` where `products`.`category_id` in (4, 7, 13)
select count(*) as aggregate from `categories` where `parent_id` = 3
---
    public function categories(Category $category)
    {
        $categories = Category::with(['products'])->where('parent_id', $category->id)->paginate(10);

select * from `products` where `products`.`category_id` in (8, 19)
select count(*) as aggregate from `categories` where `parent_id` = 4
---
    public function subcategories(Category $category, $slug)
    {
        $subcategory = Category::where('slug', $slug)->firstOrFail();

        $categories = Category::with(['products'])->where('parent_id', $subcategory->id)->paginate(10);

select * from `products` where `slug` = 'magali-schiller' limit 1
select * from `products` where `products`.`category_id` = 50 and `products`.`category_id` is not null limit 20 offset 0
select count(*) as aggregate from `products` where `products`.`category_id` = 50 and `products`.`category_id` is not null
select * from `products` where `category_id` in (9, 50) limit 20 offset 0
select count(*) as aggregate from `products` where `category_id` in (9, 50)
---
    public function slug($slugName){
        $slugs = explode('/', $slugName);

        if(count($slugs)){
            $slug = array_pop($slugs);

            if($product = Product::whereSlug($slug)->first()){
                $category = Category::where('id', $product->category_id)->tree()->first();

                return view('product-details', compact('product', 'category'))->with('page_name', 'Product Details');
            }else if($category = Category::where('slug', $slug)->tree()->first()){
                $products = $category->products()->paginate(20);

                return view('gallery', compact('products', 'category'))->with('page_name', 'Gallery');