app/Http/Controllers/FrontendController.php

select * from `products` where `home_page` = 1
select * from `products` limit 10
---
    public function index()
    {
        $products = Product::where('home_page', true)->get();
        // $all_products = Product::with('category')->get();

        $categories = Category::whereHas('products')->get();

        // dd($categories);

        return view('index', compact('products', 'categories'))->with('page_name', 'Home');

select count(*) as aggregate from `products` where `home_page` = 1
---
    public function gallery()
    {
        $products = Product::where('home_page', 1)->paginate(20);