app/Http/Controllers/FrontendController.php

    public function getProductByCategory($category)
    {
        $category = Category::where('slug', $category)->tree()->firstOrFail();
        $products = $category->products()->paginate(20);

        return view('gallery', compact('products', 'category'))->with('page_name', 'Gallery');
---
select * from `products` where `products`.`category_id` = 3 and `products`.`category_id` is not null limit 20 offset 0
select count(*) as aggregate from `products` where `products`.`category_id` = 3 and `products`.`category_id` is not null