app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `products`
select count(*) as aggregate from `categories`
select count(*) as aggregate from `users`
select count(*) as aggregate from `roles`
select count(*) as aggregate from `contacts`
select count(*) as aggregate from `faqs`
---
    public function dashboard()
    {
        session(['layout_mode' => 'left_nav']);
        // if (is_null($this->user) || !$this->user->can('dashboard.view'))

        $product_count = Product::count();
        $category_count = Category::count();
        $user_count = User::count();
        $role_count = Role::count();
        $contact_count = Contact::count();
        $faq_count = Faq::count();