app/Http/Controllers/Admin/ProductController.php

select * from `products` limit 10 offset 0
select count(*) as aggregate from `products`
---
    public function index()
    {
        $products = Product::with(['category'])->paginate(10);

insert into `products` (`category_id`, `title`, `description`, `dimension`, `origin`, `price`, `metadata`, `home_page`, `updated_at`, `created_at`) values ('2', 'Et ut earum numquam', '<p><img alt=\"\" src=\"http://127.0.0.1:8000/storage/FILE_627f58105de38627f5810.png\" style=\"height:1080px; width:1920px\" /></p>', 'Saepe esse incididun', 'Et laudantium ipsum', '996', 'Molestias atque esse', '1', '2022-05-14 13:20:26', '2022-05-14 13:20:26')
---
    public function store(ProductCreateRequest $request)
    {
        $product = Product::create($request->only(['category_id', 'title', 'description', 'dimension', 'origin', 'price', 'metadata', 'home_page']));

select * from `products` where (`slug` = 'quos-nostrum-autem-quos') limit 1
---
    public function edit($slug)
    {
        $product = Product::where(['slug'=> $slug])->firstOrFail();

select * from `products` where (`slug` = 'quos-nostrum-autem-quos') limit 1
---
    public function update(ProductUpdateRequest $request, $slug)
    {
        $product = Product::where(['slug'=> $slug])->firstOrFail();

select * from `products` where (`slug` = 'quos-nostrum-autem-quos') limit 1
---
    public function images($slug)
    {
        $product = Product::where(['slug'=> $slug])->firstOrFail();

select * from `products` where (`slug` = 'quos-nostrum-autem-quos') limit 1
---
    public function imagesAdd(Request $request,  $slug)
    {
       $request->validate([
            'image' =>  ['required','max:2048','mimes:png,jpg,jpeg'],
            'alt'  =>   ['nullable']
       ]);

       $product = Product::where(['slug'=> $slug])->firstOrFail();