app/Http/Controllers/Admin/SettingsController.php

    public function aboutUpdate()
    {
        Setting::first()->update(request()->only('about'));
---
select * from `settings` limit 1